ARM-software/CMSIS-Driver_Validation/Boards/WIZnet/WizFi360-EVB/RTE/Board_Support/MIMXRT1064DVL6A/pin_mux.h
/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
#define BOARD_INITUSDHCPINS_SD1_D0_PERIPHERAL                             USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_D0_SIGNAL                             usdhc_data   /*!< USDHC1 signal: usdhc_data */
#define BOARD_INITUSDHCPINS_SD1_D0_CHANNEL                                    0U   /*!< USDHC1 usdhc_data channel: 0 */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
#define BOARD_INITUSDHCPINS_SD1_CMD_PERIPHERAL                            USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_CMD_SIGNAL                             usdhc_cmd   /*!< USDHC1 signal: usdhc_cmd */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
#define BOARD_INITUSDHCPINS_SD1_CLK_PERIPHERAL                            USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD1_CLK_SIGNAL                             usdhc_clk   /*!< USDHC1 signal: usdhc_clk */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_PERIPHERAL                        USDHC1   /*!< Device name: USDHC1 */
#define BOARD_INITUSDHCPINS_SD0_VSELECT_SIGNAL                     usdhc_vselect   /*!< USDHC1 signal: usdhc_vselect */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSDHCPins(void);

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_PERIPHERAL                       FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_D0_A_SIGNAL                   FLEXSPI_A_DATA0   /*!< FLEXSPI signal: FLEXSPI_A_DATA0 */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_PERIPHERAL                       FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_D1_A_SIGNAL                   FLEXSPI_A_DATA1   /*!< FLEXSPI signal: FLEXSPI_A_DATA1 */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_PERIPHERAL                       FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_D2_A_SIGNAL                   FLEXSPI_A_DATA2   /*!< FLEXSPI signal: FLEXSPI_A_DATA2 */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_PERIPHERAL                       FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_D3_A_SIGNAL                   FLEXSPI_A_DATA3   /*!< FLEXSPI signal: FLEXSPI_A_DATA3 */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_PERIPHERAL                        FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_CLK_SIGNAL                     FLEXSPI_A_SCLK   /*!< FLEXSPI signal: FLEXSPI_A_SCLK */

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_PERIPHERAL                        FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_SS0_SIGNAL                    FLEXSPI_A_SS0_B   /*!< FLEXSPI signal: FLEXSPI_A_SS0_B */

/* GPIO_SD_B1_05 (coord N3), FlexSPI_DQS */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_PERIPHERAL                        FLEXSPI   /*!< Device name: FLEXSPI */
#define BOARD_INITQSPIPINS_FlexSPI_DQS_SIGNAL                      FLEXSPI_A_DQS   /*!< FLEXSPI signal: FLEXSPI_A_DQS */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPIPins(void);

/* GPIO_AD_B0_09 (coord F14), JTAG_TDI/J21[5]/ENET_RST/J22[5] */
#define BOARD_INITLEDPINS_USER_LED_GPIO                                    GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITLEDPINS_USER_LED_PORT                                    GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITLEDPINS_USER_LED_PIN                                        9U   /*!< GPIO1 pin index: 9 */


/*!
 * @brief Configures pin routing and optionally pin electrical features for LED.
 *
 */
void BOARD_InitLEDPins(void);

/* WAKEUP (coord L6), SD_PWREN */
#define BOARD_INITBUTTONSPINS_USER_BUTTON_GPIO                             GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITBUTTONSPINS_USER_BUTTON_PORT                             GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITBUTTONSPINS_USER_BUTTON_PIN                                 0U   /*!< GPIO5 pin index: 0 */


/*!
 * @brief Configures pin routing and optionally pin electrical features for Buttons.
 *
 */
void BOARD_InitButtonsPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define LPUART1_INITPINS_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Device name: LPUART1 */
#define LPUART1_INITPINS_UART1_RXD_SIGNAL                                     RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define LPUART1_INITPINS_UART1_TXD_PERIPHERAL                            LPUART1   /*!< Device name: LPUART1 */
#define LPUART1_INITPINS_UART1_TXD_SIGNAL                                     TX   /*!< LPUART1 signal: TX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_InitPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define LPUART1_DEINITPINS_UART1_RXD_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define LPUART1_DEINITPINS_UART1_RXD_SIGNAL                                   RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define LPUART1_DEINITPINS_UART1_TXD_PERIPHERAL                          LPUART1   /*!< Device name: LPUART1 */
#define LPUART1_DEINITPINS_UART1_TXD_SIGNAL                                   TX   /*!< LPUART1 signal: TX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_DeinitPins(void);

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
#define LPUART3_INITPINS_UART3_TXD_PERIPHERAL                            LPUART3   /*!< Device name: LPUART3 */
#define LPUART3_INITPINS_UART3_TXD_SIGNAL                                     TX   /*!< LPUART3 signal: TX */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
#define LPUART3_INITPINS_UART3_RXD_PERIPHERAL                            LPUART3   /*!< Device name: LPUART3 */
#define LPUART3_INITPINS_UART3_RXD_SIGNAL                                     RX   /*!< LPUART3 signal: RX */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART3_InitPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART3_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
